# Главное меню
w_mm = "Главное меню:"
w_to_mm = "В главное меню"

# Информация
w_info = "Информация"
w_info_text = """
СПб ГБУЗ поликлиника №27
Взрослое поликлиническое отделение
🗺 Адмиралтейский, 190031, Санкт-Петербург, пр-кт. Вознесенский, д. 27, лит. А
📞 +7 (812) 246-39-90
✉️ p27@zdrav.spb.ru
⏱ Часы работы:
Пн.-Пт.: 08.00–20.00
Сб-Вс.: выходной

[На карте](https://gorzdrav.spb.ru/medical-organizations-map?latitude=59.925867&longitude=30.307837&id=1)
"""

# Регистрация
w_reg = "Регистрация"

w_input_fullname = "Введите ФИО:"
w_incorrect_fullname = "Некорректная ФИО!\nПример: Иванов Иван Иванович"

w_input_birthday = "Введите дату рождения:"
w_incorrect_birthday = "Некорректная дата рождения!\nШаблон: XX.XX.XXXX"

w_input_phone = "Введите номер телефона:"
w_incorrect_phone = "Некорректный номер телефона!\nШаблон: +7XXXXXXXXXX"

w_input_policy = "Введите полис ОМС:"
w_incorrect_policy = "Некорректный ввод полиса ОМС!\nШаблон: XXXXXXXXXXXXXXX"

w_input_passport = "Введите серию и номер паспорта\n(через пробел):"
w_incorrect_passport = "Некорректный ввод паспортных даных!\nШаблон: XXXX XXXXXX"

w_reg_confirm = "Проверьте данные:"
w_reg_confirm_text = """
ФИО: {}
Дата рождения: {}
Номер телефона: {}
Полис ОМС: {}
Серия и номер паспорта: {}
"""

w_reg_ok = "Да!"
w_reg_again = "Пройти заново"
w_reg_finished = "Регистрация завершена!"

# Запись к врачу
w_record = "Запись к врачу"

w_record_specialist = "Выберите специальность:"
w_incorrect_specialist = "Этой специальности не существует!"

w_record_doctor = "Выберите врача:"
w_incorrect_doctor = "Этого доктора нет в поликлинике!"

w_record_date = "Выберите дату записи:"
w_incorrect_date = "Поликлиника не работает в этот день!"

w_record_time = "Выберите время записи:"
w_incorrect_time = "Мы не работаем в это время!\nСмотрите время работы в: Главное меню -> Информация"

# w_record_confirm = """
# Специализация врача: {}
# ФИО Врача: {}
# Дата: {}
# Время: {}
# """
# w_record_ok = "Да!"
# w_record_again = "Пройти заново"
w_record_finished = "Вы успешно записались к врачу!"

# Проверка пользователя в базе данных
w_user_exists = "Вы уже зарегистрированы!"
w_user_not_exists = "Требуется регистрация!"
